Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [9]:
data=[4, 8, 15, 16, 23,42]
df1=pd.Series(data)

In [10]:
df1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [4]:
list1=[1,2,3,4,5,6,7,8,9,10]
df=pd.Series(list1)

In [5]:
df

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [11]:
dictionary={'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']}

In [12]:
df2=pd.DataFrame(dictionary)

In [13]:
df2

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional size-mutable, tabular data structure with rows and columns, similar to a spreadsheet or a SQL table. It is a very powerful and flexible data structure for working with data in Python.

In contrast, a Series is a one-dimensional labeled array that can hold any data type (integers, strings, floats, etc.) and its associated label or index. A Series can be thought of as a single column of a DataFrame.

What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [15]:
df2.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [16]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Gender  3 non-null      object
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

In [17]:
df2.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [18]:
df2.sort_values(['Age'])

     Name  Age  Gender
0   Alice   25  Female
2  Claire   27  Female
1     Bob   30    Male

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In Pandas, both Series and DataFrame are mutable in nature, whereas Panel is immutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [20]:
import pandas as pd

# create a series for the names of fruits
fruits = pd.Series(['apple', 'banana', 'cherry', 'durian', 'elderberry'])

# create a series for the corresponding prices of the fruits
prices = pd.Series([1.00, 0.50, 2.00, 5.00, 3.50])

# create a series for the quantities of each fruit
quantities = pd.Series([10, 20, 5, 3, 8])

# create a DataFrame using the three series
df = pd.DataFrame({'fruit': fruits, 'price': prices, 'quantity': quantities})

# print the resulting DataFrame
print(df)

        fruit  price  quantity
0       apple    1.0        10
1      banana    0.5        20
2      cherry    2.0         5
3      durian    5.0         3
4  elderberry    3.5         8